БПКР/src/Catalogs/ПравилаРегулярныхРеализацийТоваровУслуг/ПравилаРегулярныхРеализацийТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаРегулярныхРеализацийТоваровУслуг</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполняется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БПКР/src/InformationRegisters/РегулярныеРеализацииТоваровУслуг/РегулярныеРеализацииТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегулярныеРеализацииТоваровУслуг</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </resources>
  <dimensions>
    <name>Правило</name>
    <type>
      <types>CatalogRef.ПравилаРегулярныхРеализацийТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/Catalogs/ПравилаРегулярныхРеализацийТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает правило по реализации
//
// Параметры:
//  РеализацияТоваровУслуг - ДокументСсылка.РеализацияТоваровУслуг
//
// Возвращаемое значение:
//  СправочникСсылка.ПравилаРегулярныхРеализацийТоваровУслуг Или Неопределено, если правило не найдено
//
Функция ПравилоПоРТУ(РеализацияТоваровУслуг) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Шаблон", РеализацияТоваровУслуг);
	Запрос.УстановитьПараметр("Организации", ОбщегоНазначенияБПВызовСервераПовтИсп.ОрганизацииДанныеКоторыхДоступныПользователю());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПравилаРегулярныхРеализацийТоваровУслуг.Ссылка КАК Правило
	|ИЗ
	|	Справочник.ПравилаРегулярныхРеализацийТоваровУслуг КАК ПравилаРегулярныхРеализацийТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегулярныеРеализацииТоваровУслуг КАК РегулярныеРеализацииТоваровУслуг
	|		ПО (РегулярныеРеализацииТоваровУслуг.Правило = ПравилаРегулярныхРеализацийТоваровУслуг.Ссылка)
	|ГДЕ
	|	ПравилаРегулярныхРеализацийТоваровУслуг.Организация В(&Организации)
	|	И РегулярныеРеализацииТоваровУслуг.Шаблон = &Шаблон";
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Правило;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции 

// Возвращает дату следующего счета по правилу.
//
// Параметры:
//   Правило - СправочникСсылка.ПравилаРегулярныхРеализацийТоваровУслуг
//
// Возвращаемое значение:
//   ДатаСледующего
//
Функция ДатаСледующего(Правило) Экспорт
	
	ДатаСледующего = Следующий(Правило).ДатаСледующего;
	
	Возврат ДатаСледующего;
	
КонецФункции

// Возвращает реквизиты следующего счета по правилу.
//
// Параметры:
//   Правило - СправочникСсылка.ПравилаРегулярныхРеализацийТоваровУслуг
//
// Возвращаемое значение:
//  Структура
//   * Организация
//   * Контрагент
//   * Сумма
//   * Шаблон
//   * ДатаШаблона
//
Функция Следующий(Правило) Экспорт
	
	СтруктураСледующий = Новый Структура;
	
	СтруктураСледующий.Вставить("Организация",    Справочники.Организации.ПустаяСсылка());
	СтруктураСледующий.Вставить("Контрагент",     Справочники.Контрагенты.ПустаяСсылка());
	СтруктураСледующий.Вставить("Сумма",          0);
	СтруктураСледующий.Вставить("ДатаСледующего", Дата(1,1,1));
	СтруктураСледующий.Вставить("ДатаШаблона",    Дата(1,1,1));
	СтруктураСледующий.Вставить("Шаблон",         Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Правило", Правило);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегулярныеРеализацииТоваровУслугСрезПоследних.Организация,
	|	РегулярныеРеализацииТоваровУслугСрезПоследних.Период КАК ДатаСледующего,
	|	РегулярныеРеализацииТоваровУслугСрезПоследних.Шаблон,
	|	РеализацияТоваровУслуг.Дата КАК ДатаШаблона,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК Сумма
	|ИЗ
	|	РегистрСведений.РегулярныеРеализацииТоваровУслуг.СрезПоследних(, Правило = &Правило) КАК РегулярныеРеализацииТоваровУслугСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РегулярныеРеализацииТоваровУслугСрезПоследних.Шаблон = РеализацияТоваровУслуг.Ссылка
	|			И РегулярныеРеализацииТоваровУслугСрезПоследних.Организация = РеализацияТоваровУслуг.Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		ЗаполнитьЗначенияСвойств(СтруктураСледующий, Выборка);
		
	КонецЕсли;
	
	Возврат СтруктураСледующий;
	
КонецФункции

// Возвращает структуру, содержащую данные для формирования надписи в форме списка счетов.
//
// Возвращаемое значение:
//  Результат - Структура:
//   * КоличествоЗапланировано – Сколько счетов запланировано
//   * КоличествоПросрочено    – Сколько счетов просрочено
//   * ДатаСледующего          – На какую дату запланирован следующий счет
//   * ОсталосьДней            – Сколько дней осталось до следующего счета
//
Функция ДанныеДляНадписиЗапланировано() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("КоличествоЗапланировано", 0);
	Результат.Вставить("КоличествоПросрочено", 0);
	Результат.Вставить("ДатаСледующего");
	Результат.Вставить("ОсталосьДней");
	
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	Запрос.УстановитьПараметр("Организации",
		ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(1) КАК Запланировано,
	|	СУММА(ВЫБОР
	|			КОГДА РегулярныеРеализацииТоваровУслугСрезПоследних.Период < &ТекущаяДата
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Просрочено,
	|	МИНИМУМ(РегулярныеРеализацииТоваровУслугСрезПоследних.Период) КАК ДатаСледующего
	|ИЗ
	|	РегистрСведений.РегулярныеРеализацииТоваровУслуг.СрезПоследних(, Правило.Выполняется) КАК РегулярныеРеализацииТоваровУслугСрезПоследних
	|ГДЕ
	|	РегулярныеРеализацииТоваровУслугСрезПоследних.Организация В(&Организации)";
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Запланировано) Тогда
		
		Результат.КоличествоЗапланировано = Выборка.Запланировано;
		Результат.КоличествоПросрочено    = Выборка.Просрочено;
		
		Результат.ДатаСледующего = Выборка.ДатаСледующего;
		
		СекундВДне = 86400;
		
		Результат.ОсталосьДней = (Выборка.ДатаСледующего - ТекущаяДата)/СекундВДне;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Для переданных правил сдвигает дату следующего запланированного документа в следующий период.
//
// Параметры:
//   Правила - Массив - Массив правил.
//
Процедура ПропуститьПовторение(Правила) Экспорт
	
	Для Каждого Правило Из Правила Цикл
		
		СтруктураСледующий = Следующий(Правило);
		
		РегистрыСведений.РегулярныеРеализацииТоваровУслуг.УстановитьШаблон(Правило, СтруктураСледующий.Шаблон);
		
	КонецЦикла;
	
КонецПроцедуры

// Создает документы по переданным правилам.
//
// Параметры:
//   Правила - Массив - Массив правил.
//
// Возвращаемое значение:
//   СозданныеДокументы - Массив - Массив ссылок на реализации товаров и услуг.
//
Функция СоздатьДокументыПоПравилам(Правила) Экспорт
	
	СозданныеДокументы = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Правила", Правила);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегулярныеРеализацииТоваровУслугСрезПоследних.Шаблон,
		|	РегулярныеРеализацииТоваровУслугСрезПоследних.Правило
		|ИЗ
		|	РегистрСведений.РегулярныеРеализацииТоваровУслуг.СрезПоследних(, Правило В (&Правила)) КАК РегулярныеРеализацииТоваровУслугСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	
	Пока Выборка.Следующий() Цикл
		
		НовыйДокумент = Выборка.Шаблон.Скопировать();
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.УстановитьНовыйНомер();
		
		НовыйДокумент.Записать();
		
		РегистрыСведений.РегулярныеРеализацииТоваровУслуг.УстановитьШаблон(Выборка.Правило, НовыйДокумент.Ссылка);
		
		СозданныеДокументы.Добавить(НовыйДокумент.Ссылка);
		
	КонецЦикла;
	
	Возврат СозданныеДокументы;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
